app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
---
  def new
    @comment = Comment.new
    @post = Post.find(params[:post_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "WHAT UP , Christine OVA HERE IN THE MOTHAFUCKIN HOUSE"], ["post_id", 8], ["user_id", 4], ["created_at", "2015-07-21 14:37:22.609221"], ["updated_at", "2015-07-21 14:37:22.609221"]]
---
  def create
    post = Post.find(params[:post_id])
    comment = post.comments.build(comment_params)
    if comment.save && request.xhr?