app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at desc
---
  def index
    @user = User.new
    @posts = Post.all.order('created_at desc')

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "HEY NOW!"], ["body", "Wasssuppp"], ["user_id", 5], ["created_at", "2015-07-21 03:43:09.998081"], ["updated_at", "2015-07-21 03:43:09.998081"]]
---
  def create
    user = User.find_by(id: session[:user_id])
    post = Post.new(post_params)
    post.user_id = session[:user_id]
    post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 7]]
---
  def show
    @user = User.new
    @post = Post.find_by_id(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
---
  def edit
    @post = Post.find_by_id(params[:id])

UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "HEY NOW! YEHHHH"], ["body", "SWEET"], ["updated_at", "2015-07-21 03:58:28.559949"], ["id", 8]]
---
  def update
    @post = Post.update(params[:id], post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "posts" SET "votes" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["votes", 1], ["updated_at", "2015-07-21 14:36:25.496092"], ["id", 7]]
---
  def up_vote
    @post = Post.find_by_id(params[:id])
    @post.increment!(:votes)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
---
  def destroy
    Post.find_by_id(params[:id]).destroy