app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "vic"], ["password_digest", "$2a$10$Uy7bOONlE8DwU.dKnqPhJug6A0Sj2cPwvFP7.KH.Yd/baxltSC2Y."], ["created_at", "2015-07-21 03:12:15.288701"], ["updated_at", "2015-07-21 03:12:15.288701"]]

  def show
    @user = User.find_by_id(params[:id])
    @user_posts = Post.where(user_id: @user.id).order("created_at desc")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY created_at desc  [["user_id", 5]]