app/controllers/welcome_controller.rb

  def index
    @user = User.new
    #Look into adding .limit(50)
    @posts = Post.all.order("created_at desc")
---
SELECT "posts".* FROM "posts"  ORDER BY created_at desc